// ------------------------------------------------------------------
// - 共通JavaScriptモジュール                  ソラン北陸(2003.09.18)
// ------------------------------------------------------------------

// ------------------------------------------------------------------
// --- 第１階層における、一定時間経過後 広告画面への遷移処理
// ------------------------------------------------------------------
function fAdvPage(){
	top.F_CACHE.F_TP2999.H_CACHE.value="0";
	top.F_MAIN.location.href="./TP2080.aspx";
}

// ------------------------------------------------------------------
// --- 第２階層以下からの一定時間経過後 戻り遷移処理
// ------------------------------------------------------------------
function fAllReload(){
	// メニューグループ画面更新
	top.F_GRUP.location.href = './TP2090.aspx?EJ=J';
}

// ------------------------------------------------------------------
// --- 縮小広告表示モードスイッチ処理
// ------------------------------------------------------------------
function fSCMSwitch(){
	var pathnm = top.F_SCM.location.search;
	if(pathnm.indexOf("VM=0") == -1){
		// 営業時間表示中
		top.F_SCM.location.href = "./TP2130.aspx?VM=0";
	}
	
	// --- (2003.12.03) ご注文内容非表示モード追加 -----------------------------
//	var pathnm = top.F_ORDER.location.search;
//	if((pathnm.indexOf("?UPDKBN=7") != -1) || (pathnm.indexOf("?UPDKBN=6&GUIDE=TRUE") != -1)){
		// ガイダンスモード → 通常表示モード
		top.F_ORDER.location.href = "./TP2060.aspx?UPDKBN=0";
//	}
	// -------------------------------------------------------------------------
	
}
